# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 4 # number of classes
activation: nn.ReLU()
kpt_shape: [9, 3]
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]
activation: nn.ReLU6() # (optional) model default activation function
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True, False]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, False]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, OAD, [nc, kpt_shape]] # Detect(P3, P4, P5)

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 8], 1, Concat, [1]] # cat backbone P5
#   - [-1, 3, C2, [768, False]] # 14

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#   - [-1, 3, C2, [512, False]] # 17

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 3, C2, [256, False]] # 20 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 17], 1, Concat, [1]] # cat head P4
#   - [-1, 3, C2, [512, False]] # 23 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 14], 1, Concat, [1]] # cat head P5
#   - [-1, 3, C2, [768, False]] # 26 (P5/32-large)

#   - [-1, 1, Conv, [768, 3, 2]]
#   - [[-1, 11], 1, Concat, [1]] # cat head P6
#   - [-1, 3, C2, [1024, False]] # 29 (P6/64-xlarge)

  # Detect 레이어에서 올바른 인덱스를 사용하도록 수정합니다.
  # - [[15, 18, 21], 1, oad, [nc, kpt_shape]] # Detect(P3, P4, P5)
  # - [[20, 23, 26, 29], 1, OAD, [nc, kpt_shape]] # Detect(P3, P4, P5)
